# ElementWillBeDetachedFromPlane Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..JoinElementsFailures..::..ElementWillBeDetachedFromPlane Property
BuiltInFailures..::..JoinElementsFailures Class See Also
---
Element will be detached from its associated plane
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementWillBeDetachedFromPlane { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementWillBeDetachedFromPlane As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementWillBeDetachedFromPlane {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..JoinElementsFailures Class
Autodesk.Revit.DB Namespace